# BendingDetailTypeAngularDimensionsMeasurement Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BendingDetailTypeAngularDimensionsMeasurement Property
ParameterTypeId Class See Also
---
"Angle Measurement"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BendingDetailTypeAngularDimensionsMeasurement { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendingDetailTypeAngularDimensionsMeasurement As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BendingDetailTypeAngularDimensionsMeasurement {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace